Tekla.Structures.Analysis.AnalysisConnectivity.CombinedTypeEnum
The combined types.

Tekla.Structures.Analysis.AnalysisConnectivity.CombinedTypeEnum.COMBINED_TYPE_FIXED
The combined type is fixed.

Tekla.Structures.Analysis.AnalysisConnectivity.CombinedTypeEnum.COMBINED_TYPE_PINNED
The combined type is pinned.

Tekla.Structures.Analysis.AnalysisConnectivity.CombinedTypeEnum.COMBINED_TYPE_OTHER
The combined type is other.